---
kind: property
id: P:Autodesk.Revit.DB.Visual.Wood.WoodThickness
source: html/f0588fc6-6b07-e76c-aa07-956c075417a9.htm
---
# Autodesk.Revit.DB.Visual.Wood.WoodThickness Property

The property labeled "Grain Thickness" from the "Wood" schema.

## Syntax (C#)
```csharp
public static string WoodThickness { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 100".